# homework module 2 exercise 11

# Напишіть функцію format_string, яка центрує рядок у рамках заданої довжини length.
#
# Задачі:
#
# 	1. Створіть функцію format_string, яка приймає два аргументи: string рядок, який потрібно форматувати та length довжина, у межах якої потрібно центрувати рядок.
# 	2. Якщо довжина string більша або дорівнює length, поверніть рядок без змін.
# 	3. Якщо довжина string менша за length, додайте перед рядком пробіли, для того, щоб рядок був центрований у рамках length. Кількість пробілів визначте за формулою (length - len(string)) // 2.
# 	4. Поверніть з функції відформатований рядок, що центрується у межах length.
#
# Очікуваний результат:
#
# Функція format_string повертає відформатований рядок відповідно до заданих правил.
#
# Підказки:
#
# Використовуйте len() для визначення довжини рядка.
# Для створення рядка з пробілів використовуйте " " * кількість_пробілів.


def format_string(string, length):
    if len(string) >= length:
        return string
    else:
        spaces = (length - len(string)) // 2
        string = " " * spaces + string
        return string

print(format_string('abc', 7))
